espressif/esp-idf/components/soc/esp32h21/register/soc/apb_saradc_struct.h
typedef struct {
    volatile apb_saradc_ctrl_reg_t saradc_ctrl;
    volatile apb_saradc_ctrl2_reg_t saradc_ctrl2;
    volatile apb_saradc_filter_ctrl1_reg_t saradc_filter_ctrl1;
    uint32_t reserved_00c[3];
    volatile apb_saradc_sar_patt_tab1_reg_t saradc_sar_patt_tab1;
    volatile apb_saradc_sar_patt_tab2_reg_t saradc_sar_patt_tab2;
    volatile apb_saradc_onetime_sample_reg_t saradc_onetime_sample;
    volatile apb_saradc_arb_ctrl_reg_t saradc_arb_ctrl;
    volatile apb_saradc_filter_ctrl0_reg_t saradc_filter_ctrl0;
    volatile apb_saradc_sar1data_status_reg_t saradc_sar1data_status;
    volatile apb_saradc_sar2data_status_reg_t saradc_sar2data_status;
    volatile apb_saradc_thres0_ctrl_reg_t saradc_thres0_ctrl;
    volatile apb_saradc_thres1_ctrl_reg_t saradc_thres1_ctrl;
    volatile apb_saradc_thres_ctrl_reg_t saradc_thres_ctrl;
    volatile apb_saradc_int_ena_reg_t saradc_int_ena;
    volatile apb_saradc_int_raw_reg_t saradc_int_raw;
    volatile apb_saradc_int_st_reg_t saradc_int_st;
    volatile apb_saradc_int_clr_reg_t saradc_int_clr;
    volatile apb_saradc_dma_conf_reg_t saradc_dma_conf;
    volatile apb_saradc_clkm_conf_reg_t saradc_clkm_conf;
    volatile apb_saradc_apb_tsens_ctrl_reg_t saradc_apb_tsens_ctrl;
    volatile apb_saradc_tsens_ctrl2_reg_t saradc_tsens_ctrl2;
    volatile apb_saradc_cali_reg_t saradc_cali;
    volatile apb_tsens_wake_reg_t tsens_wake;
    volatile apb_tsens_sample_reg_t tsens_sample;
    uint32_t reserved_06c[228];
    volatile apb_saradc_ctrl_date_reg_t saradc_ctrl_date;
} apb_dev_t;

extern apb_dev_t APB_SARADC;

#ifndef __cplusplus
_Static_assert(sizeof(apb_dev_t) == 0x400, "Invalid size of apb_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
